/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isascii.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: bmatos-d <bmatos-d@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/03/11 21:32:04 by bmatos-d          #+#    #+#             */
/*   Updated: 2024/03/20 18:05:03 by bmatos-d         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int	ft_isascii(unsigned short c)
{
	if (0 <= c && c <= 127)
	{
		return (1);
	}
	return (0);
}
/*
int main(void)
{
	if(ft_isascii("ƒ"))
	{
		write(1, "FUCKYEAH", 8);
	}
}
*/
